class_meta_principles.org
#+SETUPFILE: /home/gary/gits/emacs/.emacs.d/plugins/org-html-themes/setup/theme-readtheorg.setup
* introduction to classes

** the technique

Encapsulate logic by combining data and behavior. Why should we?
*Avoiding global state* is the most urgent, important and easiest to be
violated programming principle out there!

#+BEGIN_SRC python :results output
  class A:

      class_variable = 'class variable'

      def __init__(self, argument):
          self.data = argument

      def method_one(self):
          return self.data

      def method_two(self, argument):
          self.data = (self.data, argument)

  
  if __name__ == '__main__':

      a = A(7)
      a.method_two(77)
      print(a.method_one())
      print(A.class_variable)
#+END_SRC

#+RESULTS:
: (7, 77)
: class variable

