class_meta_principles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-30 Wed 17:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gary Klindt" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline6">1. introduction to classes</a>
<ul>
<li><a href="#orgheadline1">1.1. the technique</a></li>
<li><a href="#orgheadline2">1.2. half useful example</a></li>
<li><a href="#orgheadline4">1.3. when not to use a class</a>
<ul>
<li><a href="#orgheadline3">1.3.1. functional technique</a></li>
</ul>
</li>
<li><a href="#orgheadline5">1.4. when to use a class</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. special methods</a>
<ul>
<li><a href="#orgheadline7">2.1. <code>__plus__</code>, <code>__minus__</code>, <code>__call__</code>, <code>__index__</code></a></li>
<li><a href="#orgheadline8">2.2. iterator: <code>__iter__</code>, <code>__next__</code></a></li>
<li><a href="#orgheadline9">2.3. context manager: <code>__enter__</code>, <code>__exit__</code></a></li>
</ul>
</li>
<li><a href="#orgheadline13">3. meta technique</a>
<ul>
<li><a href="#orgheadline12">3.1. everything is a dictionary</a>
<ul>
<li><a href="#orgheadline11">3.1.1. getattr</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline14">4. application</a></li>
<li><a href="#orgheadline19">5. principles</a>
<ul>
<li><a href="#orgheadline15">5.1. the ones I used</a></li>
<li><a href="#orgheadline16">5.2. Zen of python</a></li>
<li><a href="#orgheadline17">5.3. The art of Unix programming</a></li>
<li><a href="#orgheadline18">5.4. Design patterns</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> introduction to classes</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> the technique</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Encapsulate logic by combining data and behavior. Why should we?
<b>Avoiding global state</b> is the most urgent, important and easiest to be
violated programming principle out there!
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">A</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">class_variable</span> = <span style="color: #ffa07a; font-style: italic;">'class variable'</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, argument):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.data = argument

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">method_one</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> <span style="color: #fa8072;">self</span>.data

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">method_two</span>(<span style="color: #fa8072;">self</span>, argument):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.data = (<span style="color: #fa8072;">self</span>.data, argument)


<span style="color: #fa8072;">if</span> <span style="color: #98fb98; font-weight: bold;">__name__</span> == <span style="color: #ffa07a; font-style: italic;">'__main__'</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">a</span> = A(7)
<span style="background-color: #2f4f4f;"> </span>   a.method_two(77)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(a.method_one())
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(A.class_variable)
</pre>
</div>
</div>
</div>
