class_meta_principles.org
** half useful example

Example: we have a lot of functions that take a similar set of
parameters.
#+BEGIN_SRC python :results output
  import numpy as np
  import misc
  import quick


  def phase_lag(phase_left, phase_right):
      """
      phase_left and phase_right are floats or numpy arrays of floats.
      return the phase lag between the two phases
      """
      return np.abs(phase_left - phase_right)


  def non_isochrony(phase, amplitude):
      """
      phase, amplitude are floats or numpy arrays of floats.

      return the nonisochrony
      """
      fit = misc.linear_fit(np.diff(phase), amplitude[1:] **2)
      return fit[0][0]


  if __name__ == '__main__':

      q_data = np.loadtxt('positions')
  
      with quick.Plot() as qp:
          qp.plot(phase_lag(q_data[0, :], q_data[1, :]))
          qp.set_xlabel('frame')
          qp.set_ylabel(r'$\varphi_L = \varphi_R$')
  
      print(non_isochrony(q_data[0, :], q_data[2, :]),
            non_isochrony(q_data[1, :], q_data[3, :]))
#+END_SRC

#+RESULTS:
: -8.89251948416 -5.95791757135


#+BEGIN_SRC python :results output
import numpy as np
import quick
import misc


class Chlamy:
    """
    encapsulate data of flagella and some convenience function.
    """

    def __init__(self, phase_left, phase_right, amplitude_left, amplitude_right):
        """
        all arguments are either floats or arrays of floats
        """
        self.phase_left = phase_left
        self.phase_right = phase_right
        self.amplitude_left = amplitude_left
        self.amplitude_right = amplitude_right

    def phase_lag(self):
        """
        return the phase lag between the two flagella
        """
        return np.abs(self.phase_left - self.phase_right)

    def non_isochrony(self):
        """
        return the nonisochrony of both flagella
        """

        def non_isochrony_inner(phase, amplitude):
            """
            phase, amplitude are floats or numpy arrays of floats.              
            return the nonisochrony
            """
            fit = misc.linear_fit(np.diff(phase), amplitude[1:] **2)
            return fit[0][0]

        ni_1 = non_isochrony_inner(self.phase_left, self.amplitude_left)
        ni_2 = non_isochrony_inner(self.phase_right, self.amplitude_right)

        return (ni_1, ni_2)



if __name__ == '__main__':

    chlamy = Chlamy(*np.loadtxt('positions')[:4])

    with quick.Plot() as qp:
        qp.plot(chlamy.phase_lag())
        qp.set_xlabel('frame')
        qp.set_ylabel(r'$\varphi_L = \varphi_R$')

    print(chlamy.non_isochrony())
#+END_SRC

#+RESULTS:
: (-8.8925194841562192, -5.9579175713523291)


