class_meta_principles.html

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> half useful example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Example: we have a lot of functions that take a similar set of
parameters.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">import</span> numpy <span style="color: #fa8072;">as</span> np
<span style="color: #fa8072;">import</span> misc
<span style="color: #fa8072;">import</span> quick


<span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">phase_lag</span>(phase_left, phase_right):
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   phase_left and phase_right are floats or numpy arrays of floats.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   return the phase lag between the two phases</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> np.<span style="color: #98fb98; font-weight: bold;">abs</span>(phase_left - phase_right)


<span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">non_isochrony</span>(phase, amplitude):
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   phase, amplitude are floats or numpy arrays of floats.</span>

<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   return the nonisochrony</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">fit</span> = misc.linear_fit(np.diff(phase), amplitude[1:] **2)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> fit[0][0]


<span style="color: #fa8072;">if</span> <span style="color: #98fb98; font-weight: bold;">__name__</span> == <span style="color: #ffa07a; font-style: italic;">'__main__'</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">q_data</span> = np.loadtxt(<span style="color: #ffa07a; font-style: italic;">'positions'</span>)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">with</span> quick.Plot() <span style="color: #fa8072;">as</span> qp:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.plot(phase_lag(q_data[0, :], q_data[1, :]))
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.set_xlabel(<span style="color: #ffa07a; font-style: italic;">'frame'</span>)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.set_ylabel(r<span style="color: #ffa07a; font-style: italic;">'$\varphi_L = \varphi_R$'</span>)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(non_isochrony(q_data[0, :], q_data[2, :]),
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span> non_isochrony(q_data[1, :], q_data[3, :]))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">import</span> numpy <span style="color: #fa8072;">as</span> np
<span style="color: #fa8072;">import</span> quick
<span style="color: #fa8072;">import</span> misc


<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Chlamy</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   encapsulate data of flagella and some convenience function.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, phase_left, phase_right, amplitude_left, amplitude_right):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   all arguments are either floats or arrays of floats</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.phase_left = phase_left
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.phase_right = phase_right
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.amplitude_left = amplitude_left
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.amplitude_right = amplitude_right

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">phase_lag</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   return the phase lag between the two flagella</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> np.<span style="color: #98fb98; font-weight: bold;">abs</span>(<span style="color: #fa8072;">self</span>.phase_left - <span style="color: #fa8072;">self</span>.phase_right)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">non_isochrony</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   return the nonisochrony of both flagella</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">non_isochrony_inner</span>(phase, amplitude):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   phase, amplitude are floats or numpy arrays of floats.              </span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   return the nonisochrony</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">fit</span> = misc.linear_fit(np.diff(phase), amplitude[1:] **2)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> fit[0][0]

<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">ni_1</span> = non_isochrony_inner(<span style="color: #fa8072;">self</span>.phase_left, <span style="color: #fa8072;">self</span>.amplitude_left)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">ni_2</span> = non_isochrony_inner(<span style="color: #fa8072;">self</span>.phase_right, <span style="color: #fa8072;">self</span>.amplitude_right)

<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> (ni_1, ni_2)



<span style="color: #fa8072;">if</span> <span style="color: #98fb98; font-weight: bold;">__name__</span> == <span style="color: #ffa07a; font-style: italic;">'__main__'</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">chlamy</span> = Chlamy(*np.loadtxt(<span style="color: #ffa07a; font-style: italic;">'positions'</span>)[:4])

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">with</span> quick.Plot() <span style="color: #fa8072;">as</span> qp:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.plot(chlamy.phase_lag())
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.set_xlabel(<span style="color: #ffa07a; font-style: italic;">'frame'</span>)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   qp.set_ylabel(r<span style="color: #ffa07a; font-style: italic;">'$\varphi_L = \varphi_R$'</span>)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(chlamy.non_isochrony())
</pre>
</div>
</div>
</div>
