class_meta_principles.org
** when not to use a class

   *Overengineering is dangerous!*

Do not use classes if you don't have to.

#+BEGIN_SRC python :results output
  class TooSimple:

      def __init__(self, data):
          self.data = data

      def call(self, value):
          return self.data + value

  ts = TooSimple(4)
  print(ts.call(5))
#+END_SRC

#+RESULTS:
: 9

*** functional technique

 Use functions instead. Functions are first class citizens of python!
=> Function may be arguments to other functions as well as return
values. They are treated as normal data objects.

#+BEGIN_SRC python :results output
def very_simple(data):
    def call(value):
        return data + value
    return call

ts = very_simple(4)
print(ts(5))
#+END_SRC

#+RESULTS:
: 9

** when to use a class

- having different functions that share the same data (see example)
  *data encapsulation*
- define programming interfaces explicitely
  *be explicit*
- allow for polymorphism: duck typing
  *don't repeat yourself*
- using patterns: for example facade: provide the same interface for
  different things.

#+BEGIN_SRC python :exports none
  import sys
  import multiprocessing import Pool


  class CalcAssist:

      def set_parameter(parameter):
          pass

      def __call__():
          pass

      def save_results(handle=sys.stdout):
          pass


  def parallelize(calc_assitent, parameters, processes=None):
      """
      calc_assistant: an instance of a class that has the same interface as CalcAssist.
      parameters: a list of scalars. Each element is supplied to CalcAssist.__call__
      processes: number of processes to spawn. Default is the number of parameters.

      This function executes calc_assistent for all parameters in
      parallel, printing the results to standard out.
      """

      if processes is None:
          processes = len(parameters)
      
      def do_it(p):
          calc_assistant.set_parameter(p)
          calc_assistant()
          return calc_assistant

      with Pool(processes=processes) as pool:
          for ca in pool.map(do_it, parameters):
              ca.save_results()
#+END_SRC


* special methods

programming language designers tend to provide the possibility to
allow users to extent their code functionality in a way that *looks
consistent* with the language itself.

