class_meta_principles.html


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.3</span> when not to use a class</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Overengineering is dangerous!</b>
</p>

<p>
Do not use classes if you don't have to.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">TooSimple</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, data):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.data = data

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">call</span>(<span style="color: #fa8072;">self</span>, value):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> <span style="color: #fa8072;">self</span>.data + value

<span style="color: #7fffd4; font-weight: bold; font-style: italic;">ts</span> = TooSimple(4)
<span style="color: #fa8072;">print</span>(ts.call(5))
</pre>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.3.1</span> functional technique</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
 Use functions instead. Functions are first class citizens of python!
=&gt; Function may be arguments to other functions as well as return
values. They are treated as normal data objects.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">very_simple</span>(data):
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">call</span>(value):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> data + value
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> call

<span style="color: #7fffd4; font-weight: bold; font-style: italic;">ts</span> = very_simple(4)
<span style="color: #fa8072;">print</span>(ts(5))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.4</span> when to use a class</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>having different functions that share the same data (see example)
<b>data encapsulation</b></li>
<li>define programming interfaces explicitely
<b>be explicit</b></li>
<li>allow for polymorphism: duck typing
<b>don't repeat yourself</b></li>
<li>using patterns: for example facade: provide the same interface for
different things.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> special methods</h2>
<div class="outline-text-2" id="text-2">
<p>
programming language designers tend to provide the possibility to
allow users to extent their code functionality in a way that <b>looks
consistent</b> with the language itself.
</p>
</div>
