class_meta_principles.org
** =__plus__=, =__minus__=, =__call__=, =__index__=

#+BEGIN_SRC python :results output
  class Polynom:
      """
      represent polynoms that can be summed, negated and evaluated
      """

      def __init__(self, c, nx, ny, nz):
          """
          => c * (x ** nx) * (y ** ny) * (z ** nz)
          ni being integers, please
          """
          self.intern = {}
          if c != 0:
              self.intern[(nx, ny, nz)] = c

          
      def add_term(self, c, nx, ny, nz):
          """
          add another term to the polynom
          """
          if (nx, ny, nz) in self.intern:
              self.intern[(nx, ny, nz)] += c
          else:
              self.intern[(nx, ny, nz)] = c

          
      def __neg__(self):
          pol = Polynom(0,0,0,0)
          for (key, c) in self.intern.items():
              pol.intern[key] = -c
          return pol


      def __add__(self, polynom):
          pol = Polynom(0,0,0,0)
          for ph in [self, polynom]:
              for (nx, ny, nz) in ph.intern:
                  pol.add_term(ph.intern[(nx, ny, nz)], nx, ny, nz)
          return pol

  
      def __sub__(self, polynom):
          return self + -polynom

  
      def __call__(self,x,y,z):
          val = 0
          for (nx,ny,nz) in self.intern:
              h = self.intern[(nx,ny,nz)]
              if nx > 0:
                  h *= x**nx
              if ny > 0:
                  h *= y**ny
              if nz > 0:
                  h *= z**nz
              val += h
          return val


      def __repr__(self):
          h = ''
          for (nx,ny,nz) in self.intern:
              h += '{0}'.format(self.intern[(nx,ny,nz)])
              for x in range(nx):
                  h += 'x'
              for y in range(ny):
                  h += 'y'
              for z in range(nz):
                  h += 'z'
              h = h+' + '
          return h[:-3]


  if __name__ == '__main__':

      import numpy as np
    
      one = Polynom(1, 0, 0, 0)
      x = Polynom(1, 1, 0, 0)
      xxyzz = Polynom(1, 2, 1, 2)
      xyz5 = Polynom(5, 1, 1, 1)
      yy = Polynom(1, 0, 2, 0)

      polynom_1 = one - xxyzz + (-yy)
      polynom_2 = np.sum([-one, x, xyz5])

      r = (2, 3, 4)
      print('{0} = {1}'.format(polynom_1, polynom_1(*r)))
      print('{0} = {1}'.format(polynom_2, polynom_2(*r)))
#+END_SRC

#+RESULTS:
: 1x + -1yy + 5xyz + 1 + -1xxyzz = -78

Another nice aspect about implemtenting those interfaces is that we
are able to *reuse* function that just use those interfaces.

