class_meta_principles.html

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.1</span> <code>__plus__</code>, <code>__minus__</code>, <code>__call__</code>, <code>__index__</code></h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Polynom</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   represent polynoms that can be summed, negated and evaluated</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, c, nx, ny, nz):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   =&gt; c * (x ** nx) * (y ** ny) * (z ** nz)</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   ni being integers, please</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span> = {}
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> c != 0:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx, ny, nz)] = c


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">add_term</span>(<span style="color: #fa8072;">self</span>, c, nx, ny, nz):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   add another term to the polynom</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> (nx, ny, nz) <span style="color: #fa8072;">in</span> <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx, ny, nz)] += c
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">else</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx, ny, nz)] = c


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__neg__</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">pol</span> = Polynom(0,0,0,0)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> (key, c) <span style="color: #fa8072;">in</span> <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>.items():
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   pol.<span style="color: #98fb98; font-weight: bold;">intern</span>[key] = -c
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> pol


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__add__</span>(<span style="color: #fa8072;">self</span>, polynom):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">pol</span> = Polynom(0,0,0,0)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> ph <span style="color: #fa8072;">in</span> [<span style="color: #fa8072;">self</span>, polynom]:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> (nx, ny, nz) <span style="color: #fa8072;">in</span> ph.<span style="color: #98fb98; font-weight: bold;">intern</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   pol.add_term(ph.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx, ny, nz)], nx, ny, nz)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> pol


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__sub__</span>(<span style="color: #fa8072;">self</span>, polynom):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> <span style="color: #fa8072;">self</span> + -polynom


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__call__</span>(<span style="color: #fa8072;">self</span>,x,y,z):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">val</span> = 0
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> (nx,ny,nz) <span style="color: #fa8072;">in</span> <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> = <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx,ny,nz)]
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> nx &gt; 0:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> *= x**nx
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> ny &gt; 0:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> *= y**ny
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> nz &gt; 0:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> *= z**nz
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">val</span> += h
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> val


<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__repr__</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> = <span style="color: #ffa07a; font-style: italic;">''</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> (nx,ny,nz) <span style="color: #fa8072;">in</span> <span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> += <span style="color: #ffa07a; font-style: italic;">'{0}'</span>.<span style="color: #98fb98; font-weight: bold;">format</span>(<span style="color: #fa8072;">self</span>.<span style="color: #98fb98; font-weight: bold;">intern</span>[(nx,ny,nz)])
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> x <span style="color: #fa8072;">in</span> <span style="color: #98fb98; font-weight: bold;">range</span>(nx):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> += <span style="color: #ffa07a; font-style: italic;">'x'</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> y <span style="color: #fa8072;">in</span> <span style="color: #98fb98; font-weight: bold;">range</span>(ny):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> += <span style="color: #ffa07a; font-style: italic;">'y'</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">for</span> z <span style="color: #fa8072;">in</span> <span style="color: #98fb98; font-weight: bold;">range</span>(nz):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> += <span style="color: #ffa07a; font-style: italic;">'z'</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">h</span> = h+<span style="color: #ffa07a; font-style: italic;">' + '</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> h[:-3]


<span style="color: #fa8072;">if</span> <span style="color: #98fb98; font-weight: bold;">__name__</span> == <span style="color: #ffa07a; font-style: italic;">'__main__'</span>:

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">import</span> numpy <span style="color: #fa8072;">as</span> np

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">one</span> = Polynom(1, 0, 0, 0)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">x</span> = Polynom(1, 1, 0, 0)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">xxyzz</span> = Polynom(1, 2, 1, 2)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">xyz5</span> = Polynom(5, 1, 1, 1)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">yy</span> = Polynom(1, 0, 2, 0)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">polynom_1</span> = one - xxyzz + (-yy)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">polynom_2</span> = np.<span style="color: #98fb98; font-weight: bold;">sum</span>([-one, x, xyz5])

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">r</span> = (2, 3, 4)
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(<span style="color: #ffa07a; font-style: italic;">'{0} = {1}'</span>.<span style="color: #98fb98; font-weight: bold;">format</span>(polynom_1, polynom_1(*r)))
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">print</span>(<span style="color: #ffa07a; font-style: italic;">'{0} = {1}'</span>.<span style="color: #98fb98; font-weight: bold;">format</span>(polynom_2, polynom_2(*r)))
</pre>
</div>

<p>
Another nice aspect about implemtenting those interfaces is that we
are able to <b>reuse</b> function that just use those interfaces.
</p>
</div>
</div>
