class_meta_principles.org
** iterator: =__iter__=, =__next__=
Consistent look
#+BEGIN_SRC python
for element in iterator:
    do_something_with(element)
#+END_SRC

** context manager: =__enter__=, =__exit__=
Encapsulate state
#+BEGIN_SRC python
with Context() as c:
    do_something_with(c)
#+END_SRC


* meta technique

meta programming allows the programmer to modify the internal
structure of the language and to extent program code dynamically. This
is closely related to *programmatically creating code*. In this way
boilerplate code can be avoided, which helps fulfilling the pricinple
to *never duplicate code*.

Code may become very unreadable, this is ok for your own projects,
nobody has to read, which is more likely the case for a
scientist. Usually it is good practice to avoid metaprogramming.

** everything is a dictionary

this is why metaprogramming works so easily in python.

*** getattr

getattr allows us to dynamically generate methods.

#+BEGIN_SRC python :results output
  class Meta:
      """
      a class that when a method is called, returns the name and
      the arguments of that call.
      """
      def __getattr__(self, name):
          def internal_function(*args, **kwargs):
              return (name, args, kwargs)
          return internal_function

  m = Meta()
  print(dir(m))
  print(m.called('bla'))
#+END_SRC

#+RESULTS:
: ['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__gt__', '__hash__', '__init__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__']
: ('called', ('bla',), {})


