class_meta_principles.html

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.2</span> iterator: <code>__iter__</code>, <code>__next__</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Consistent look
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">for</span> element <span style="color: #fa8072;">in</span> iterator:
<span style="background-color: #2f4f4f;"> </span>   do_something_with(element)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.3</span> context manager: <code>__enter__</code>, <code>__exit__</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Encapsulate state
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">with</span> Context() <span style="color: #fa8072;">as</span> c:
<span style="background-color: #2f4f4f;"> </span>   do_something_with(c)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> meta technique</h2>
<div class="outline-text-2" id="text-3">
<p>
meta programming allows the programmer to modify the internal
structure of the language and to extent program code dynamically. This
is closely related to <b>programmatically creating code</b>. In this way
boilerplate code can be avoided, which helps fulfilling the pricinple
to <b>never duplicate code</b>.
</p>

<p>
Code may become very unreadable, this is ok for your own projects,
nobody has to read, which is more likely the case for a
scientist. Usually it is good practice to avoid metaprogramming.
</p>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.1</span> everything is a dictionary</h3>
<div class="outline-text-3" id="text-3-1">
<p>
this is why metaprogramming works so easily in python.
</p>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.1.1</span> getattr</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
getattr allows us to dynamically generate methods.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Meta</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   a class that when a method is called, returns the name and</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   the arguments of that call.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__getattr__</span>(<span style="color: #fa8072;">self</span>, name):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">internal_function</span>(*args, **kwargs):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> (name, args, kwargs)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> internal_function

<span style="color: #7fffd4; font-weight: bold; font-style: italic;">m</span> = Meta()
<span style="color: #fa8072;">print</span>(<span style="color: #98fb98; font-weight: bold;">dir</span>(m))
<span style="color: #fa8072;">print</span>(m.called(<span style="color: #ffa07a; font-style: italic;">'bla'</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
