class_meta_principles.org
* application

I find Matplotlib is messy:
There are two interfaces:
- scripting (flawed because of state engine (global state!))
- object oriented (flawed because class interfaces are much too broad)
- there is a lot of redundance (do not duplicate code!)

Encapsulate messy matplotlib into consistent context manager by using
the dictionary structure of classes and modules and =__getattr_=.

#+BEGIN_SRC python
  import sys

  class Plot(object):
      """
      this class mimics matplotlib's axis class. All its methods are
      available.
      Additionally, the with construction can be used.
      """

      def __init__(self, filename=None, figsize=(3, 3), grid=True, **kwargs):
          """ initialize an axes object """
          import matplotlib.pyplot as plt
          self.plt = plt
          self.filename = filename
          self.fig = plt.figure(figsize=figsize)
          self.axe = plt.subplot(111, **kwargs)
          self.axe.grid(grid)

      def __enter__(self):
          """ assign the return value to the with target """
          return self

      def __exit__(self, type, value, traceback):
          """
          since this class is not made for exception handling, but for
          plotting, we do not use the arguments to the method.
          """
          import matplotlib as mlib
          mlib.rcParams['text.latex.preamble'].append(r'\usepackage{amsmath}')
          mlib.rcParams['text.latex.preamble'].append(r'\usepackage{amssymb}')
          mlib.rc('text', usetex=True)

          if self.filename is not None:
              self.fig.savefig(self.filename, bbox_inches='tight')
          else:
              self.plt.show()

          self.plt.close(fig)

      def __getattr__(self, name):
          """ this object should act like a matplotlib axis object """
          res = None
          try:
              res = getattr(self.axe, name)
          except:
              res = getattr(self.plt, name)
          return res



  class WithEncapsulate(object):
      """
      All locals of this class will be transferred to the module's namespace,
      because then, the __getattr__ method can be used for creating methods at
      runtime, which later leads the creation of module functions at runtime.
      """

      def __init__(self, classconstructor, argname):
          """
          save a classconstructor, whose class will be instantiated constantly.
          classconstructor is instantiated with exactly one argument.
          for each function call, that one argument may be provided by an
          optional argument, its default value is None.
          """
          self.classconstructor = classconstructor
          self.argname = argname

      def __getattr__(self, name):
          """ make methods of QuickPlot available as method of this wrapper """
          if name == self.classconstructor.__name__:
              return self.classconstructor
          def hfunc(*args, **kwargs):
              value = None
              if self.argname in kwargs:
                  value = kwargs[self.argname]
                  del kwargs[self.argname]
              with self.classconstructor(value) as plt:
                  getattr(plt, name)(*args, **kwargs)
          return hfunc

  ### release Plot and all the matplotlib axis methods as functions.
  sys.modules[__name__] = WithEncapsulate(Plot, 'filename')
#+END_SRC

Let's use it...

#+BEGIN_SRC python
  import numpy as np
  import quick
  import velocityfield as vf
  import misc


  oseen_xy = lambda x, y: vf.oseentensor([x, y, 1])
  grid = np.linspace(-4, 4, 100)

  oseens = np.array([[oseen_xy(x, y) for x in grid] for y in grid])
  oseens = np.concatenate([oseens[:, :, i, j] for (i, j) in [(0, 1), (1, 2)]],
                          axis=1)


  quick.imshow(oseens)

  with quick.Plot() as qp:

      qp.remove_border()
      qp.set_xlabel(r'$x$')
      qp.set_ylabel(r'$y$')
      qp.imshow(oseens, 'BrBG')
      qp.colorbar(oseens, 'BrBG')

#+END_SRC

#+RESULTS:
: None


