class_meta_principles.html


<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">4</span> application</h2>
<div class="outline-text-2" id="text-4">
<p>
I find Matplotlib is messy:
There are two interfaces:
</p>
<ul class="org-ul">
<li>scripting (flawed because of state engine (global state!))</li>
<li>object oriented (flawed because class interfaces are much too broad)</li>
<li>there is a lot of redundance (do not duplicate code!)</li>
</ul>

<p>
Encapsulate messy matplotlib into consistent context manager by using
the dictionary structure of classes and modules and <code>__getattr_</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">import</span> sys

<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Plot</span>(<span style="color: #98fb98; font-weight: bold;">object</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   this class mimics matplotlib's axis class. All its methods are</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   available.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   Additionally, the with construction can be used.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, filename=<span style="color: #7fffd4; font-weight: bold;">None</span>, figsize=(3, 3), grid=<span style="color: #7fffd4; font-weight: bold;">True</span>, **kwargs):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">""" initialize an axes object """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">import</span> matplotlib.pyplot <span style="color: #fa8072;">as</span> plt
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.plt = plt
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.filename = filename
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.fig = plt.figure(figsize=figsize)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.axe = plt.subplot(111, **kwargs)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.axe.grid(grid)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__enter__</span>(<span style="color: #fa8072;">self</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">""" assign the return value to the with target """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> <span style="color: #fa8072;">self</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__exit__</span>(<span style="color: #fa8072;">self</span>, <span style="color: #98fb98; font-weight: bold;">type</span>, value, traceback):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   since this class is not made for exception handling, but for</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   plotting, we do not use the arguments to the method.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">import</span> matplotlib <span style="color: #fa8072;">as</span> mlib
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   mlib.rcParams[<span style="color: #ffa07a; font-style: italic;">'text.latex.preamble'</span>].append(r<span style="color: #ffa07a; font-style: italic;">'\usepackage{amsmath}'</span>)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   mlib.rcParams[<span style="color: #ffa07a; font-style: italic;">'text.latex.preamble'</span>].append(r<span style="color: #ffa07a; font-style: italic;">'\usepackage{amssymb}'</span>)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   mlib.rc(<span style="color: #ffa07a; font-style: italic;">'text'</span>, usetex=<span style="color: #7fffd4; font-weight: bold;">True</span>)

<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> <span style="color: #fa8072;">self</span>.filename <span style="color: #fa8072;">is</span> <span style="color: #fa8072;">not</span> <span style="color: #7fffd4; font-weight: bold;">None</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.fig.savefig(<span style="color: #fa8072;">self</span>.filename, bbox_inches=<span style="color: #ffa07a; font-style: italic;">'tight'</span>)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">else</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.plt.show()

<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.plt.close(fig)

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__getattr__</span>(<span style="color: #fa8072;">self</span>, name):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">""" this object should act like a matplotlib axis object """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">res</span> = <span style="color: #7fffd4; font-weight: bold;">None</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">try</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">res</span> = <span style="color: #98fb98; font-weight: bold;">getattr</span>(<span style="color: #fa8072;">self</span>.axe, name)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">except</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">res</span> = <span style="color: #98fb98; font-weight: bold;">getattr</span>(<span style="color: #fa8072;">self</span>.plt, name)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> res



<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">WithEncapsulate</span>(<span style="color: #98fb98; font-weight: bold;">object</span>):
<span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   All locals of this class will be transferred to the module's namespace,</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   because then, the __getattr__ method can be used for creating methods at</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   runtime, which later leads the creation of module functions at runtime.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__init__</span>(<span style="color: #fa8072;">self</span>, classconstructor, argname):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">"""</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   save a classconstructor, whose class will be instantiated constantly.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   classconstructor is instantiated with exactly one argument.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   for each function call, that one argument may be provided by an</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   optional argument, its default value is None.</span>
<span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   </span><span style="color: #ffa07a; background-color: #2f4f4f; font-style: italic;"> </span><span style="color: #ffa07a; font-style: italic;">   """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.classconstructor = classconstructor
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">self</span>.argname = argname

<span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">__getattr__</span>(<span style="color: #fa8072;">self</span>, name):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #ffa07a; font-style: italic;">""" make methods of QuickPlot available as method of this wrapper """</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> name == <span style="color: #fa8072;">self</span>.classconstructor.<span style="color: #98fb98; font-weight: bold;">__name__</span>:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> <span style="color: #fa8072;">self</span>.classconstructor
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">def</span> <span style="color: #7b68ee; font-weight: bold;">hfunc</span>(*args, **kwargs):
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">value</span> = <span style="color: #7fffd4; font-weight: bold;">None</span>
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">if</span> <span style="color: #fa8072;">self</span>.argname <span style="color: #fa8072;">in</span> kwargs:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #7fffd4; font-weight: bold; font-style: italic;">value</span> = kwargs[<span style="color: #fa8072;">self</span>.argname]
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">del</span> kwargs[<span style="color: #fa8072;">self</span>.argname]
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">with</span> <span style="color: #fa8072;">self</span>.classconstructor(value) <span style="color: #fa8072;">as</span> plt:
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #98fb98; font-weight: bold;">getattr</span>(plt, name)(*args, **kwargs)
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="color: #fa8072;">return</span> hfunc

<span style="color: #ffffff;">### </span><span style="color: #ffffff;">release Plot and all the matplotlib axis methods as functions.</span>
<span style="color: #7fffd4; font-weight: bold; font-style: italic;">sys.modules</span>[<span style="color: #98fb98; font-weight: bold;">__name__</span>] = WithEncapsulate(Plot, <span style="color: #ffa07a; font-style: italic;">'filename'</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">import</span> numpy <span style="color: #fa8072;">as</span> np
<span style="color: #fa8072;">import</span> quick
<span style="color: #fa8072;">import</span> velocityfield <span style="color: #fa8072;">as</span> vf
<span style="color: #fa8072;">import</span> misc


<span style="color: #7fffd4; font-weight: bold; font-style: italic;">oseen_xy</span> = <span style="color: #fa8072;">lambda</span> x, y: vf.oseentensor([x, y, 1])
<span style="color: #7fffd4; font-weight: bold; font-style: italic;">grid</span> = np.linspace(-4, 4, 100)

<span style="color: #7fffd4; font-weight: bold; font-style: italic;">oseens</span> = np.array([[oseen_xy(x, y) <span style="color: #fa8072;">for</span> x <span style="color: #fa8072;">in</span> grid] <span style="color: #fa8072;">for</span> y <span style="color: #fa8072;">in</span> grid])
<span style="color: #7fffd4; font-weight: bold; font-style: italic;">oseens</span> = np.concatenate([oseens[:, :, i, j] <span style="color: #fa8072;">for</span> (i, j) <span style="color: #fa8072;">in</span> [(0, 1), (1, 2)]],
<span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   <span style="background-color: #2f4f4f;"> </span>   axis=1)


quick.imshow(oseens)

<span style="color: #fa8072;">with</span> quick.Plot() <span style="color: #fa8072;">as</span> qp:

<span style="background-color: #2f4f4f;"> </span>   qp.remove_border()
<span style="background-color: #2f4f4f;"> </span>   qp.set_xlabel(r<span style="color: #ffa07a; font-style: italic;">'$x$'</span>)
<span style="background-color: #2f4f4f;"> </span>   qp.set_ylabel(r<span style="color: #ffa07a; font-style: italic;">'$y$'</span>)
<span style="background-color: #2f4f4f;"> </span>   qp.imshow(oseens, <span style="color: #ffa07a; font-style: italic;">'BrBG'</span>)
<span style="background-color: #2f4f4f;"> </span>   qp.colorbar(oseens, <span style="color: #ffa07a; font-style: italic;">'BrBG'</span>)
</pre>
</div>
</div>
</div>
