class_meta_principles.org
* principles

** the ones I used

- write content and logic only once
- be consistent, least surprise
- avoid global state
- write modular code (only possible with little global state)

** Zen of python

#+BEGIN_SRC python :results output
  import this
#+END_SRC

#+RESULTS:

The Zen of Python, by Tim Peters

- Beautiful is better than ugly.
- Explicit is better than implicit.
- Simple is better than complex.
- Complex is better than complicated.
- Flat is better than nested.
- Sparse is better than dense.
- Readability counts.
- Special cases aren't special enough to break the rules.
- Although practicality beats purity.
- Errors should never pass silently.
- Unless explicitly silenced.
- In the face of ambiguity, refuse the temptation to guess.
- There should be one-- and preferably only one --obvious way to do it.
- Although that way may not be obvious at first unless you're Dutch.
- Now is better than never.
- Although never is often better than *right* now.
- If the implementation is hard to explain, it's a bad idea.
- If the implementation is easy to explain, it may be a good idea.
- Namespaces are one honking great idea -- let's do more of those!

** The art of Unix programming

[[https://en.wikipedia.org/wiki/Unix_philosophy]]

- Rule of Modularity
- Rule of Clarity
- Rule of Composition
- Rule of Separation
- Rule of Simplicity
- Rule of Parsimony
- Rule of Transparency
- Rule of Robustness
- Rule of Representation
- Rule of Least Surprise
- Rule of Silence
- Rule of Repair
- Rule of Economy
- Rule of Generation
- Rule of Optimization
- Rule of Diversity
- Rule of Extensibility
** Design patterns

For fulfilling some of the principles mentioned above, design patterns
were developed. Most of them are made for older Versions of static
languages like Java and are obsolete in modern Python. They usually
emphasise flexibility of program structures in the way, such that
programs or libraries are hard to be misused, but easily extended,
without interfering with already existing code.

Interfaces are made very explicite and communication between
developers is eased, but only when all developers are familiar with
the concept. Independent working of many people on the same projects
shall be facilitated.
