class_meta_principles.html


<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">5</span> principles</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">5.1</span> the ones I used</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>write content and logic only once</li>
<li>be consistent, least surprise</li>
<li>avoid global state</li>
<li>write modular code (only possible with little global state)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">5.2</span> Zen of python</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #fa8072;">import</span> this
</pre>
</div>

<p>
The Zen of Python, by Tim Peters
</p>

<ul class="org-ul">
<li>Beautiful is better than ugly.</li>
<li>Explicit is better than implicit.</li>
<li>Simple is better than complex.</li>
<li>Complex is better than complicated.</li>
<li>Flat is better than nested.</li>
<li>Sparse is better than dense.</li>
<li>Readability counts.</li>
<li>Special cases aren't special enough to break the rules.</li>
<li>Although practicality beats purity.</li>
<li>Errors should never pass silently.</li>
<li>Unless explicitly silenced.</li>
<li>In the face of ambiguity, refuse the temptation to guess.</li>
<li>There should be one&#x2013; and preferably only one &#x2013;obvious way to do it.</li>
<li>Although that way may not be obvious at first unless you're Dutch.</li>
<li>Now is better than never.</li>
<li>Although never is often better than <b>right</b> now.</li>
<li>If the implementation is hard to explain, it's a bad idea.</li>
<li>If the implementation is easy to explain, it may be a good idea.</li>
<li>Namespaces are one honking great idea &#x2013; let's do more of those!</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">5.3</span> The art of Unix programming</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<a href="https://en.wikipedia.org/wiki/Unix_philosophy">https://en.wikipedia.org/wiki/Unix_philosophy</a>
</p>

<ul class="org-ul">
<li>Rule of Modularity</li>
<li>Rule of Clarity</li>
<li>Rule of Composition</li>
<li>Rule of Separation</li>
<li>Rule of Simplicity</li>
<li>Rule of Parsimony</li>
<li>Rule of Transparency</li>
<li>Rule of Robustness</li>
<li>Rule of Representation</li>
<li>Rule of Least Surprise</li>
<li>Rule of Silence</li>
<li>Rule of Repair</li>
<li>Rule of Economy</li>
<li>Rule of Generation</li>
<li>Rule of Optimization</li>
<li>Rule of Diversity</li>
<li>Rule of Extensibility</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">5.4</span> Design patterns</h3>
<div class="outline-text-3" id="text-5-4">
<p>
For fulfilling some of the principles mentioned above, design patterns
were developed. Most of them are made for older Versions of static
languages like Java and are obsolete in modern Python. They usually
emphasise flexibility of program structures in the way, such that
programs or libraries are hard to be misused, but easily extended,
without interfering with already existing code.
</p>

<p>
Interfaces are made very explicite and communication between
developers is eased, but only when all developers are familiar with
the concept. Independent working of many people on the same projects
shall be facilitated.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gary Klindt</p>
<p class="date">Created: 2016-03-30 Wed 17:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
